In [2]:
import pandas as pd
df = pd.read_csv("friends.csv")
df

      name        city  marks
0    Harry      Rampur     92
1    Rohan     Kolkata     34
2   Skillf    Bareilly     24
3    Shubh  Antarctica     17
4    Harry      Ranchi     93
5    Aamit     Kolkata     15
6    Ahmed       Delhi     14
7  Raheman      Mumbai     34

In [3]:
df.shape

(8, 3)

               city  marks
name
Harry        Rampur     92
Rohan       Kolkata     34
Skillf     Bareilly     24
Shubh    Antarctica     17
Harry        Ranchi     93
Aamit       Kolkata     15
Ahmed         Delhi     14
Raheman      Mumbai     34